In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from matplotlib import cm
import seaborn as sns
import plotly.express as px

In [2]:
plt.rcParams['font.family'] = 'Malgun Gothic' #한글깨짐 방지/맑은고딕체
plt.rcParams['axes.unicode_minus'] = False #마이너스 기호 깨짐 방지

In [ ]:
pd.set_option('float_format', '{:.2f}'.format)
pd.options.mode.chained_assignment = None #워닝메세지 없애기

In [9]:
M = pd.DataFrame({'x1':['Ace','Best','Cross'], 'x2' : [1,2,3]})
N = pd.DataFrame({'x1' : ['Best','Cross','Dream','Energy'], 'x2': [2,3,4,5]})
O = pd.DataFrame({'x2': [1,3,7,8], 'x3':['Ace','Cross','Bird','Giant']})

In [6]:
M

      x1  x2
0    Ace   1
1   Best   2
2  Cross   3

In [7]:
N

       x1  x2
0    Best   2
1   Cross   3
2   Dream   4
3  Energy   5

In [10]:
O

   x2     x3
0   1    Ace
1   3  Cross
2   7   Bird
3   8  Giant

In [11]:
#합집합

pd.merge(M, N, how = 'outer')

       x1  x2
0     Ace   1
1    Best   2
2   Cross   3
3   Dream   4
4  Energy   5

In [12]:
pd.merge(N, M, how = 'outer')

       x1  x2
0    Best   2
1   Cross   3
2   Dream   4
3  Energy   5
4     Ace   1

In [13]:
pd.merge(M, O, how = 'outer')

      x1  x2     x3
0    Ace   1    Ace
1   Best   2    NaN
2  Cross   3  Cross
3    NaN   7   Bird
4    NaN   8  Giant

In [14]:
# 교집합

pd.merge(M, N, how = 'inner')

      x1  x2
0   Best   2
1  Cross   3

In [15]:
pd.merge(N, O, how = 'inner')

      x1  x2     x3
0  Cross   3  Cross

In [25]:
#차집합

df = pd.merge(M,N,how = 'outer', indicator = True)
df
# indicator 인수, True로하면 원래 데이터를 포함한 열이 추가. 기본적으로 _merge 행 추가

       x1  x2      _merge
0     Ace   1   left_only
1    Best   2        both
2   Cross   3        both
3   Dream   4  right_only
4  Energy   5  right_only

In [26]:
df_left =  df[df['_merge'] == 'right_only'].drop('_merge', axis = 1)
df_left

       x1  x2
3   Dream   4
4  Energy   5

In [27]:
df_both = df[df['_merge'] == 'both'].drop('_merge',axis = 1)
df_both

      x1  x2
1   Best   2
2  Cross   3

In [28]:
A = pd.DataFrame({'id':["c01","c02","c03","c04"], 
                    'last':["Kim", "Lee", "Choi", "Park"],
                    'gender':["F", "M", "F", "M"]})

S = pd.DataFrame({'id':["c03","c04","c07","c08"],
                    'age':[19, 40, 29, 30], 
                    'income':[1500, 3400, 3020, 4500]})

In [29]:
A

    id  last gender
0  c01   Kim      F
1  c02   Lee      M
2  c03  Choi      F
3  c04  Park      M

In [30]:
S

    id  age  income
0  c03   19    1500
1  c04   40    3400
2  c07   29    3020
3  c08   30    4500

In [31]:
pd.merge(A,S,left_on = 'id', right_on = 'id', how = 'inner')

    id  last gender  age  income
0  c03  Choi      F   19    1500
1  c04  Park      M   40    3400

In [32]:
pd.merge(S, A, left_on = 'id', right_on = 'id', how = 'inner')

    id  age  income  last gender
0  c03   19    1500  Choi      F
1  c04   40    3400  Park      M

In [33]:
pd.merge(A, S, left_on = 'id', right_on = 'id', how = 'outer')

    id  last gender   age  income
0  c01   Kim      F   NaN     NaN
1  c02   Lee      M   NaN     NaN
2  c03  Choi      F  19.0  1500.0
3  c04  Park      M  40.0  3400.0
4  c07   NaN    NaN  29.0  3020.0
5  c08   NaN    NaN  30.0  4500.0

In [34]:
pd.merge(A,S,left_on = 'id', right_on = 'id', how = 'left')

    id  last gender   age  income
0  c01   Kim      F   NaN     NaN
1  c02   Lee      M   NaN     NaN
2  c03  Choi      F  19.0  1500.0
3  c04  Park      M  40.0  3400.0